//-------------------------------------------------------------------------------------------------
// File : Obj.h
// Desc : Wavefront OBJ Module.
// Copyright(c) Project Asura. All right reserved.
//-------------------------------------------------------------------------------------------------
#pragma once

//-------------------------------------------------------------------------------------------------
// Includes
//-------------------------------------------------------------------------------------------------
#include <asdxMath.h>
#include <vector>
#include <string>


///////////////////////////////////////////////////////////////////////////////////////////////////
// ResMTL structure
///////////////////////////////////////////////////////////////////////////////////////////////////
struct ResMTL
{
    std::string     Name;           //!< マテリアル名.
    asdx::Vector3   Ambient;        //!< 環境遮蔽.
    asdx::Vector3   Diffuse;        //!< 拡散反射.
    asdx::Vector3   Specular;       //!< 鏡面反射.
    f32             Alpha;          //!< 透過度.
    f32             Power;          //!< 鏡面反射強度.
    std::string     AmbientMap;     //!< アンビエントマップ名.
    std::string     DiffuseMap;     //!< ディフューズマップ名.
    std::string     SpecularMap;    //!< スペキュラーマップ名.
    std::string     BumpMap;        //!< バンプマップ名.
};

///////////////////////////////////////////////////////////////////////////////////////////////////
// ResSubset structure
//////////////////////////////////////////////////////////////////////////////////////////////////
struct ResSubset
{
    std::string     Name;       //!< 適用マテリアル名.
    u32             Offset;     //!< オフセット.
    u32             Count;      //!< カウント.
};

///////////////////////////////////////////////////////////////////////////////////////////////////
// ResOBJ structure
///////////////////////////////////////////////////////////////////////////////////////////////////
struct ResOBJ
{
    std::vector<asdx::Vector3>  Positions;      //!< 位置座標です.
    std::vector<asdx::Vector2>  TexCoords;      //!< テクスチャ座標です.
    std::vector<asdx::Vector3>  Normals;        //!< 法線ベクトルです.
    std::vector<u32>            Indices;        //!< 頂点インデックスです.
    std::vector<ResSubset>      Subsets;        //!< サブセットです.
    std::vector<ResMTL>         Materials;      //!< マテリアルです.
};

//-------------------------------------------------------------------------------------------------
//! @brief      OBJファイルから読み込みします.
//!
//! @param[in]      filename        ファイル名.
//! @param[out]     pResult         格納先.
//! @retval true    読み込みに成功.
//! @retval false   読み込みに失敗.
//-------------------------------------------------------------------------------------------------
bool LoadFromOBJ( const char* filename, ResOBJ* pResult );

